cf_billing/InformationRegisters/энргДлительностиПериодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргДлительностиПериодов</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сезонность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыСезонности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСезонностьПеречисление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдлаитьэнргВидыСезонности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргДлительностиПериодов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет периоды сезонности.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ПериодыСезонности(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаПериодыСезонности());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, Сезонность";
		ИмяТаблицы 					= "энргДлительностиПериодов";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;	 	
	
	ВспомогательныеПоля 			= "Период,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет периоды сезонности коллекция периодов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаПериодов		-	Строка.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ПериодыСезонностиКоллекцияПериодов(Схема,ПараметрыОтбора,ТаблицаПериодов,ТаблицаДляПомещения = "") Экспорт
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТексЗапросаПериодыСезонностиКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0].Источники[0].Источник.Запрос.Операторы[0].Источники[0].Источник.Запрос.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[1].Источник;
		
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, Сезонность";
		ИмяТаблицы 					= "ДлительностиПериодов";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;	 	
	
	ВспомогательныеПоля 			= "Период,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
КонецПроцедуры

// Заполняет периоды сезонности пустая таблица.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ПериодыСезонностиПустаяТаблица(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт 
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТексЗапросаПериодыСезонностиПустаяТаблица());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет длительности периодов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция ДлительностиПериодов(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДлительностиПериодов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Сезонность, Район";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
		Для Сч = 0 По ПараметрыОтбора.ПараметрыВТ.ВГраница() Цикл
			Если ПараметрыОтбора.ПараметрыВТ[Сч].ТипПараметра = "ТипПараметраВременнаяТаблица" Тогда
				Пакет.Операторы[0].Отбор.Очистить();
				СоотвествиеПолей 			= ПараметрыОтбора.ПараметрыВТ[Сч].СоотвествиеПолей;
				ОтборДляУстановки 			= Новый Структура("ИмяПараметра,ТипПараметра,СоотвествиеПолей", ПараметрыОтбора.ПараметрыВТ[Сч].ИмяПараметра,"ТипПараметраВременнаяТаблица", СоотвествиеПолей);
				энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор,"энргДлительностиПериодовСрезПоследних",ОтборДляУстановки, "");
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;	 	
		
	ВспомогательныеПоля 			= "Период,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецФункции

// Получает текст запроса длительности периодов.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаДлительностиПериодов() Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	энргДлительностиПериодовСрезПоследних.Организация КАК Организация,
	|	энргДлительностиПериодовСрезПоследних.Сезонность КАК Сезонность,
	|	энргДлительностиПериодовСрезПоследних.Район КАК Район,
	|	энргДлительностиПериодовСрезПоследних.НачалоПериода КАК НачалоПериода,
	|	энргДлительностиПериодовСрезПоследних.КонецПериода КАК КонецПериода
	|ИЗ
	|	РегистрСведений.энргДлительностиПериодов.СрезПоследних КАК энргДлительностиПериодовСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПериодыСезонности()
	Текст  = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Сезонность КАК Сезонность,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.НачалоСезонности КАК НачалоСезонности,
	|	ВложенныйЗапрос.КонецСезонности КАК КонецСезонности,
	|	&НачалоПериодаРасчета КАК НачалоОП,
	|	&ЗавершениеПериодаРасчета КАК ЗавершениеОП
	|ПОМЕСТИТЬ ПериодыСезонности
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргДлительностиПериодов.Организация КАК Организация,
	|		энргДлительностиПериодов.Сезонность КАК Сезонность,
	|		энргДлительностиПериодов.Район КАК Район,
	|		ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ГОД(&НачалоПериодаРасчета) - ВЫБОР
	|						КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|								И МЕСЯЦ(энргДлительностиПериодов.КонецПериода) < МЕСЯЦ(&ПериодНачисления)
	|								И МЕСЯЦ(&ПериодНачисления) <= МЕСЯЦ(энргДлительностиПериодов.НачалоПериода)
	|							ТОГДА 1
	|						КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|								И МЕСЯЦ(&ПериодНачисления) <= МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|							ТОГДА 2
	|						КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|								И МЕСЯЦ(&ПериодНачисления) > МЕСЯЦ(энргДлительностиПериодов.НачалоПериода)
	|							ТОГДА 1
	|						КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.НачалоПериода)
	|							ТОГДА 2
	|						ИНАЧЕ 1
	|					КОНЕЦ), МЕСЯЦ, МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) - 1), ДЕНЬ, ДЕНЬ(энргДлительностиПериодов.НачалоПериода) - 1) КАК НачалоСезонности,
	|		ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ГОД(&НачалоПериодаРасчета) - ВЫБОР
	|						КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|								И МЕСЯЦ(энргДлительностиПериодов.КонецПериода) < МЕСЯЦ(&ПериодНачисления)
	|								И МЕСЯЦ(&ПериодНачисления) <= МЕСЯЦ(энргДлительностиПериодов.НачалоПериода)
	|							ТОГДА 0
	|						КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|								И МЕСЯЦ(&ПериодНачисления) <= МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|							ТОГДА 1
	|						КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.КонецПериода)
	|								И МЕСЯЦ(&ПериодНачисления) > МЕСЯЦ(энргДлительностиПериодов.НачалоПериода)
	|							ТОГДА 0
	|						КОГДА МЕСЯЦ(энргДлительностиПериодов.НачалоПериода) > МЕСЯЦ(энргДлительностиПериодов.НачалоПериода)
	|							ТОГДА 1
	|						ИНАЧЕ 1
	|					КОНЕЦ), МЕСЯЦ, МЕСЯЦ(энргДлительностиПериодов.КонецПериода) - 1), ДЕНЬ, ДЕНЬ(энргДлительностиПериодов.КонецПериода)) КАК КонецСезонности
	|	ИЗ
	|		РегистрСведений.энргДлительностиПериодов.СрезПоследних КАК энргДлительностиПериодов) КАК ВложенныйЗапрос";
	
	Возврат Текст;
	
КонецФункции

Функция ТексЗапросаПериодыСезонностиКоллекцияПериодов()
	Текст  = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Сезонность КАК Сезонность,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.НачалоСезонности КАК НачалоСезонности,
	|	ВложенныйЗапрос.КонецСезонности КАК КонецСезонности,
	|	ВложенныйЗапрос.НачалоОП КАК НачалоОП,
	|	ВложенныйЗапрос.ЗавершениеОП КАК ЗавершениеОП,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ВЫБОР
	|					КОГДА ВложенныйЗапрос.НачалоОП >= ВложенныйЗапрос.НачалоСезонности
	|						ТОГДА ВложенныйЗапрос.НачалоОП
	|					ИНАЧЕ ВложенныйЗапрос.НачалоСезонности
	|				КОНЕЦ, ВЫБОР
	|					КОГДА ВложенныйЗапрос.ЗавершениеОП >= ВложенныйЗапрос.КонецСезонности
	|						ТОГДА ВложенныйЗапрос.КонецСезонности
	|					ИНАЧЕ ВложенныйЗапрос.ЗавершениеОП
	|				КОНЕЦ, ДЕНЬ) > 0
	|			ТОГДА РАЗНОСТЬДАТ(ВЫБОР
	|						КОГДА ВложенныйЗапрос.НачалоОП >= ВложенныйЗапрос.НачалоСезонности
	|							ТОГДА ВложенныйЗапрос.НачалоОП
	|						ИНАЧЕ ВложенныйЗапрос.НачалоСезонности
	|					КОНЕЦ, ВЫБОР
	|						КОГДА ВложенныйЗапрос.ЗавершениеОП >= ВложенныйЗапрос.КонецСезонности
	|							ТОГДА ВложенныйЗапрос.КонецСезонности
	|						ИНАЧЕ ВложенныйЗапрос.ЗавершениеОП
	|					КОНЕЦ, ДЕНЬ)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоДнейСезонности,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ВЫБОР
	|					КОГДА ВложенныйЗапрос.НачалоОП >= ВложенныйЗапрос.НачалоСезонности
	|						ТОГДА ВложенныйЗапрос.НачалоОП
	|					ИНАЧЕ ВложенныйЗапрос.НачалоСезонности
	|				КОНЕЦ, ВЫБОР
	|					КОГДА ВложенныйЗапрос.ЗавершениеОП >= ВложенныйЗапрос.КонецСезонности
	|						ТОГДА ВложенныйЗапрос.КонецСезонности
	|					ИНАЧЕ ВложенныйЗапрос.ЗавершениеОП
	|				КОНЕЦ, ДЕНЬ) > 0
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоМесяцевСезонности
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Сезонность КАК Сезонность,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.НачалоОП КАК НачалоОП,
	|		ВложенныйЗапрос.ЗавершениеОП КАК ЗавершениеОП,
	|		ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ГОД(ВложенныйЗапрос.НачалоОП) - ВЫБОР
	|						КОГДА МЕСЯЦ(ВложенныйЗапрос.НачалоПериода) > МЕСЯЦ(ВложенныйЗапрос.КонецПериода)
	|								И МЕСЯЦ(ВложенныйЗапрос.КонецПериода) < МЕСЯЦ(ВложенныйЗапрос.ПериодНачисления)
	|								И МЕСЯЦ(ВложенныйЗапрос.ПериодНачисления) <= МЕСЯЦ(ВложенныйЗапрос.НачалоПериода)
	|							ТОГДА 1
	|						КОГДА МЕСЯЦ(ВложенныйЗапрос.НачалоПериода) > МЕСЯЦ(ВложенныйЗапрос.КонецПериода)
	|								И МЕСЯЦ(ВложенныйЗапрос.ПериодНачисления) <= МЕСЯЦ(ВложенныйЗапрос.КонецПериода)
	|							ТОГДА 2
	|						КОГДА МЕСЯЦ(ВложенныйЗапрос.НачалоПериода) > МЕСЯЦ(ВложенныйЗапрос.КонецПериода)
	|								И МЕСЯЦ(ВложенныйЗапрос.ПериодНачисления) > МЕСЯЦ(ВложенныйЗапрос.НачалоПериода)
	|							ТОГДА 1
	|						КОГДА МЕСЯЦ(ВложенныйЗапрос.НачалоПериода) > МЕСЯЦ(ВложенныйЗапрос.НачалоПериода)
	|							ТОГДА 2
	|						ИНАЧЕ 1
	|					КОНЕЦ), МЕСЯЦ, МЕСЯЦ(ВложенныйЗапрос.НачалоПериода) - 1), ДЕНЬ, ДЕНЬ(ВложенныйЗапрос.НачалоПериода) - 1) КАК НачалоСезонности,
	|		ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, ГОД(ВложенныйЗапрос.НачалоОП) - ВЫБОР
	|						КОГДА МЕСЯЦ(ВложенныйЗапрос.НачалоПериода) > МЕСЯЦ(ВложенныйЗапрос.КонецПериода)
	|								И МЕСЯЦ(ВложенныйЗапрос.КонецПериода) < МЕСЯЦ(ВложенныйЗапрос.ПериодНачисления)
	|								И МЕСЯЦ(ВложенныйЗапрос.ПериодНачисления) <= МЕСЯЦ(ВложенныйЗапрос.НачалоПериода)
	|							ТОГДА 0
	|						КОГДА МЕСЯЦ(ВложенныйЗапрос.НачалоПериода) > МЕСЯЦ(ВложенныйЗапрос.КонецПериода)
	|								И МЕСЯЦ(ВложенныйЗапрос.ПериодНачисления) <= МЕСЯЦ(ВложенныйЗапрос.КонецПериода)
	|							ТОГДА 1
	|						КОГДА МЕСЯЦ(ВложенныйЗапрос.НачалоПериода) > МЕСЯЦ(ВложенныйЗапрос.КонецПериода)
	|								И МЕСЯЦ(ВложенныйЗапрос.ПериодНачисления) > МЕСЯЦ(ВложенныйЗапрос.НачалоПериода)
	|							ТОГДА 0
	|						КОГДА МЕСЯЦ(ВложенныйЗапрос.НачалоПериода) > МЕСЯЦ(ВложенныйЗапрос.НачалоПериода)
	|							ТОГДА 1
	|						ИНАЧЕ 1
	|					КОНЕЦ), МЕСЯЦ, МЕСЯЦ(ВложенныйЗапрос.КонецПериода) - 1), ДЕНЬ, ДЕНЬ(ВложенныйЗапрос.КонецПериода)) КАК КонецСезонности
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|			ВложенныйЗапрос.НачалоОП КАК НачалоОП,
	|			ВложенныйЗапрос.ЗавершениеОП КАК ЗавершениеОП,
	|			ВложенныйЗапрос.Организация КАК Организация,
	|			ВложенныйЗапрос.Район КАК Район,
	|			ВложенныйЗапрос.Сезонность КАК Сезонность,
	|			ДлительностиПериодов.НачалоПериода КАК НачалоПериода,
	|			ДлительностиПериодов.КонецПериода КАК КонецПериода
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ТаблицаПериодов.ПериодНачисления КАК ПериодНачисления,
	|				ТаблицаПериодов.НачалоОП КАК НачалоОП,
	|				ТаблицаПериодов.ЗавершениеОП КАК ЗавершениеОП,
	|				ДлительностиПериодов.Организация КАК Организация,
	|				ДлительностиПериодов.Район КАК Район,
	|				ДлительностиПериодов.Сезонность КАК Сезонность,
	|				МАКСИМУМ(ДлительностиПериодов.Период) КАК Период
	|			ИЗ
	|				РегистрСведений.энргДлительностиПериодов КАК ДлительностиПериодов
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|					ПО ДлительностиПериодов.Организация = ТаблицаПериодов.Организация
	|						И ДлительностиПериодов.Район = ТаблицаПериодов.Район
	|			ГДЕ
	|				ГОД(ТаблицаПериодов.ПериодНачисления) <= ГОД(ДлительностиПериодов.Период)
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ТаблицаПериодов.ПериодНачисления,
	|				ТаблицаПериодов.НачалоОП,
	|				ТаблицаПериодов.ЗавершениеОП,
	|				ДлительностиПериодов.Организация,
	|				ДлительностиПериодов.Район,
	|				ДлительностиПериодов.Сезонность) КАК ВложенныйЗапрос
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргДлительностиПериодов КАК ДлительностиПериодов
	|				ПО ВложенныйЗапрос.Организация = ДлительностиПериодов.Организация
	|					И ВложенныйЗапрос.Район = ДлительностиПериодов.Район
	|					И ВложенныйЗапрос.Сезонность = ДлительностиПериодов.Сезонность
	|					И ВложенныйЗапрос.Период = ДлительностиПериодов.Период) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос"; 		
		
	Возврат Текст;
КонецФункции

Функция ТексЗапросаПериодыСезонностиПустаяТаблица()
	Текст  = 
	"ВЫБРАТЬ
	|	ДлительностиПериодов.Организация КАК Организация,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодНачисления,
	|	ДлительностиПериодов.Сезонность КАК Сезонность,
	|	ДлительностиПериодов.Район КАК Район,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК НачалоСезонности,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК КонецСезонности,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК НачалоОП,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ЗавершениеОП,
	|	0 КАК КоличествоДнейСезонности,
	|	0 КАК КоличествоМесяцевСезонности
	|ИЗ
	|	РегистрСведений.энргДлительностиПериодов КАК ДлительностиПериодов
	|ГДЕ
	|	ЛОЖЬ";
	Возврат Текст;
КонецФункции

#КонецОбласти

#КонецЕсли
